//25. Найти сумму чисел от 1 до А
Console.WriteLine("Введите граничную цифру");
int A = int.Parse(Console.ReadLine());
Console.WriteLine();
Console.WriteLine($"Сума чисел от 1 до {A} ={A*(A+1)/2}");
//int n = 0;   или по дурацки
//for (int i = 0; i <= A; i++)
//{
   // Console.WriteLine(n+=i);
//}